# ExportLinetypeKey Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeKey Class
Members See Also
---
A key used to represent an item stored in an ExportLinetypeTable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportLinetypeKey : IDisposable
```

Visual Basic
---
```text
Public Class ExportLinetypeKey _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExportLinetypeKey : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportLinetypeKey
# See Also
ExportLinetypeKey Members
Autodesk.Revit.DB Namespace